<?php
/**
 * 所有枚举类型的数据
 */

$config = array('Enums' => array(
	// 与户主关系
	'family_status' => array(
		'0' => '户主',
		'1' => '子女',
		'2' => '配偶',
		'3' => '父母',
		'4' => '其他',
	),
	// 婚姻状态
	'marriage_status' => array(
		'0' => '未婚',
		'1' => '已婚',
		'2' => '离异',
		'3' => '其他',
	),
	// 政治面貌
	'political_status' => array(
		'0' => '群众',
		'1' => '团员',
		'2' => '党员(预备)',
		'3' => '民主党派',
		'4' => '其他',
	),
	// 是否自住
	'is_owner' => array(
		'1' => '是',
		'0' => '否',
	),
	// 性别
	'gender' => array(
		'1' => '男',
		'0' => '女',
	),
));
